RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_tmr4.c
/**
 *******************************************************************************
 * @file  hc32f4a0_tmr4.c
 * @brief This file provides firmware functions to manage the TMR4(Timer4)
 @verbatim
   Change Logs:
   Date             Author          Notes
   2020-06-12       Hongjh          First version
   2020-07-15       Hongjh          Modify error parameter assert condition for
                                    the function TMR4_PWM_SetPclkDiv.
   2020-07-25       Hongjh          Modify TMR4_OCO_SetLowChCompareMode function
                                    comment:from TMR4_OCO_UH/VH/WH to TMR4_OCO_UL/VL/WL
 @endverbatim
 *******************************************************************************
 * Copyright (C) 2020, Huada Semiconductor Co., Ltd. All rights reserved.
 *
 * This software component is licensed by HDSC under BSD 3-Clause license
 * (the "License"); You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                    opensource.org/licenses/BSD-3-Clause
 *
 *******************************************************************************
 */

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32f4a0_tmr4.h"
#include "hc32f4a0_utility.h"

/**
 * @addtogroup HC32F4A0_DDL_Driver
 * @{
 */

/**
 * @defgroup DDL_TMR4 TMR4
 * @brief TMR4 Driver Library
 * @{
 */

#if (DDL_TMR4_ENABLE == DDL_ON)

/*******************************************************************************
 * Local type definitions ('typedef')
 ******************************************************************************/

/*******************************************************************************
 * Local pre-processor symbols/macros ('#define')
 ******************************************************************************/
/**
 * @defgroup TMR4_Local_Macros TMR4 Local Macros
 * @{
 */

/**
 * @defgroup TMR4_Check_Parameters_Validity TMR4 Check Parameters Validity
 * @{
 */

#define IS_VALID_TMR4_INSTANCE(x)                                              \
(   (M4_TMR4_1 == (x))                          ||                             \
    (M4_TMR4_2 == (x))                          ||                             \
    (M4_TMR4_3 == (x)))

#define IS_VALID_TMR4_CNT_PCLK_DIV(x)                                           \
(   (TMR4_CNT_PCLK_DIV1 == (x))                  ||                             \
    (TMR4_CNT_PCLK_DIV2 == (x))                  ||                             \
    (TMR4_CNT_PCLK_DIV4 == (x))                  ||                             \
    (TMR4_CNT_PCLK_DIV8 == (x))                  ||                             \
    (TMR4_CNT_PCLK_DIV16 == (x))                 ||                             \
    (TMR4_CNT_PCLK_DIV32 == (x))                 ||                             \
    (TMR4_CNT_PCLK_DIV64 == (x))                 ||                             \
    (TMR4_CNT_PCLK_DIV128 == (x))                ||                             \
    (TMR4_CNT_PCLK_DIV256 == (x))                ||                             \
    (TMR4_CNT_PCLK_DIV512 == (x))                ||                             \
    (TMR4_CNT_PCLK_DIV1024 == (x)))

#define IS_VALID_TMR4_CNT_MODE(x)                                              \
(   (TMR4_CNT_MODE_SAWTOOTH_WAVE == (x))        ||                             \
    (TMR4_CNT_MODE_TRIANGLE_WAVE == (x)))

#define IS_VALID_TMR4_CNT_BUF_STATE(x)                                         \
(   (TMR4_CNT_BUFFER_ENABLE == (x))             ||                             \
    (TMR4_CNT_BUFFER_DISABLE == (x)))

#define IS_VALID_TMR4_CNT_CLK_SRC(x)                                           \
(   (TMR4_CNT_PCLK == (x))                      ||                             \
    (TMR4_CNT_EXTCLK == (x)))

#define IS_VALID_TMR4_CNT_INT_MASKTIMES(x)                                     \
(   (TMR4_CNT_INT_MASK_0 == (x))                ||                             \
    (TMR4_CNT_INT_MASK_1 == (x))                ||                             \
    (TMR4_CNT_INT_MASK_2 == (x))                ||                             \
    (TMR4_CNT_INT_MASK_3 == (x))                ||                             \
    (TMR4_CNT_INT_MASK_4 == (x))                ||                             \
    (TMR4_CNT_INT_MASK_5 == (x))                ||                             \
    (TMR4_CNT_INT_MASK_6 == (x))                ||                             \
    (TMR4_CNT_INT_MASK_7 == (x))                ||                             \
    (TMR4_CNT_INT_MASK_8 == (x))                ||                             \
    (TMR4_CNT_INT_MASK_9 == (x))                ||                             \
    (TMR4_CNT_INT_MASK_10 == (x))               ||                             \
    (TMR4_CNT_INT_MASK_11 == (x))               ||                             \
    (TMR4_CNT_INT_MASK_12 == (x))               ||                             \
    (TMR4_CNT_INT_MASK_13 == (x))               ||                             \
    (TMR4_CNT_INT_MASK_14 == (x))               ||                             \
    (TMR4_CNT_INT_MASK_15 == (x)))

#define IS_VALID_TMR4_CNT_INT(x)                                               \
(   (0UL != (x))                                 &&                            \
    (TMR4_CNT_INT_MASK == ((x) | TMR4_CNT_INT_MASK)))

#define IS_VALID_TMR4_CNT_FLAG(x)                                              \
(   (0UL != (x))                                 &&                            \
    (TMR4_CNT_FLAG_MASK == ((x) | TMR4_CNT_FLAG_MASK)))

#define IS_VALID_TMR4_OCO_CH(x)                                                \
(   (TMR4_OCO_UH == (x))                        ||                             \
    (TMR4_OCO_UL == (x))                        ||                             \
    (TMR4_OCO_VH == (x))                        ||                             \
    (TMR4_OCO_VL == (x))                        ||                             \
    (TMR4_OCO_WH == (x))                        ||                             \
    (TMR4_OCO_WL == (x)))

#define IS_VALID_TMR4_OCO_HIGH_CH(x)                                           \
(   (TMR4_OCO_UH == (x))                        ||                             \
    (TMR4_OCO_VH == (x))                        ||                             \
    (TMR4_OCO_WH == (x)))

#define IS_VALID_TMR4_OCO_LOW_CH(x)                                            \
(   (TMR4_OCO_UL == (x))                        ||                             \
    (TMR4_OCO_VL == (x))                        ||                             \
    (TMR4_OCO_WL == (x)))

#define IS_VALID_TMR4_OCO_STATE(x)                                             \
(   (TMR4_OCO_DISABLE == (x))                   ||                             \
    (TMR4_OCO_ENABLE == (x)))

#define IS_VALID_TMR4_OCO_EXTEND_MATCH(x)                                      \
(   (TMR4_OCO_EXTEND_MATCH_DISABLE == (x))      ||                             \
    (TMR4_OCO_EXTEND_MATCH_ENABLE == (x)))

#define IS_VALID_TMR4_OCO_OCCR_LINK_TRANSFER(x)                                \
(   (TMR4_OCO_OCCR_LINK_TRANSFER_DISABLE == (x))    ||                         \
    (TMR4_OCO_OCCR_LINK_TRANSFER_ENABLE == (x)))

#define IS_VALID_TMR4_OCO_OCCR_BUF_MODE(x)                                     \
(   (TMR4_OCO_OCCR_BUF_DISABLE == (x))          ||                             \
    (TMR4_OCO_OCCR_BUF_CNT_ZERO == (x))         ||                             \
    (TMR4_OCO_OCCR_BUF_CNT_PEAK == (x))         ||                             \
    (TMR4_OCO_OCCR_BUF_CNT_ZERO_OR_PEAK == (x)))

#define IS_VALID_TMR4_OCO_OCMR_LINK_TRANSFER(x)                                \
(   (TMR4_OCO_OCMR_LINK_TRANSFER_DISABLE == (x))    ||                         \
    (TMR4_OCO_OCMR_LINK_TRANSFER_ENABLE == (x)))

