RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_tmr4.c
/*******************************************************************************
 * Global variable definitions (declared in header file with 'extern')
 ******************************************************************************/

/*******************************************************************************
 * Local function prototypes ('static')
 ******************************************************************************/

/*******************************************************************************
 * Local variable definitions ('static')
 ******************************************************************************/

/*******************************************************************************
 * Function implementation - global ('extern') and local ('static')
 ******************************************************************************/

/**
 * @defgroup TMR4_Global_Functions TMR4 Global Functions
 * @{
 */

/**
 * @defgroup TMR4_CNT_Global_Functions TMR4 Counter Global Functions
 * @{
 */

/**
 * @brief  Initialize TMR4 counter.
 * @param  [in] TMR4x                   Pointer to TMR4 instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMR4_1:            TMR4 unit 1 instance register base
 *           @arg M4_TMR4_2:            TMR4 unit 2 instance register base
 *           @arg M4_TMR4_3:            TMR4 unit 3 instance register base
 * @param  [in] pstcInit                Pointer to a @ref stc_tmr4_cnt_init_t structure
 * @retval An en_result_t enumeration value:
 *           - Ok: Initialize successfully
 *           - ErrorInvalidParameter: pstcInit = NULL
 */
en_result_t TMR4_CNT_Init(M4_TMR4_TypeDef *TMR4x,
                                const stc_tmr4_cnt_init_t *pstcInit)
{
    uint16_t u16Val;
    en_result_t enRet = ErrorInvalidParameter;

    /* Check structure pointer */
    if (NULL != pstcInit)
    {
        /* Check parameters */
        DDL_ASSERT(IS_VALID_TMR4_INSTANCE(TMR4x));
        DDL_ASSERT(IS_VALID_TMR4_CNT_BUF_STATE(pstcInit->u16BufState));
        DDL_ASSERT(IS_VALID_TMR4_CNT_MODE(pstcInit->u16CntMode));
        DDL_ASSERT(IS_VALID_TMR4_CNT_PCLK_DIV(pstcInit->u16PclkDiv));
        DDL_ASSERT(IS_VALID_TMR4_CNT_CLK_SRC(pstcInit->u16ClkSrc));
        DDL_ASSERT(IS_VALID_TMR4_CNT_INT_MASKTIMES(pstcInit->u16ZeroIntMask));
        DDL_ASSERT(IS_VALID_TMR4_CNT_INT_MASKTIMES(pstcInit->u16PeakIntMask));

        /* Set default value */
        WRITE_REG16(TMR4x->CCSR, 0x0050U);
        WRITE_REG16(TMR4x->CVPR, 0x0000U);

        /* Set count clock div && cnt mode && buffer enable bit &&
           external clock enable bit && interrupt enable bit */
        u16Val = (pstcInit->u16PclkDiv  | \
                  pstcInit->u16ClkSrc  | \
                  pstcInit->u16CntMode | \
                  TMR4_CCSR_STOP       | \
                  pstcInit->u16BufState);
        WRITE_REG16(TMR4x->CCSR, u16Val);

        /* set interrupt mask times */
        u16Val = (((uint16_t)(pstcInit->u16ZeroIntMask << TMR4_CVPR_ZIM_POS)) | \
                  ((uint16_t)(pstcInit->u16PeakIntMask << TMR4_CVPR_PIM_POS)));
        WRITE_REG16(TMR4x->CVPR, u16Val);

        /* Set TMR4 cycle */
        WRITE_REG16(TMR4x->CPSR, pstcInit->u16CycleVal);
        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  Set the fields of structure stc_tmr4_cnt_init_t to default values
 * @param  [out] pstcInit               Pointer to a @ref stc_tmr4_cnt_init_t structure
 * @retval An en_result_t enumeration value:
 *           - Ok: Initialize successfully
 *           - ErrorInvalidParameter: pstcInit = NULL
 */
en_result_t TMR4_CNT_StructInit(stc_tmr4_cnt_init_t *pstcInit)
{
    en_result_t enRet = ErrorInvalidParameter;

    /* Check structure pointer */
    if (NULL != pstcInit)
    {
        pstcInit->u16CycleVal = 0xFFFFU;
        pstcInit->u16CntMode = TMR4_CNT_MODE_SAWTOOTH_WAVE;
        pstcInit->u16ClkSrc = TMR4_CNT_PCLK;
        pstcInit->u16PclkDiv = TMR4_CNT_PCLK_DIV1;
        pstcInit->u16ZeroIntMask = TMR4_CNT_INT_MASK_0;
        pstcInit->u16PeakIntMask = TMR4_CNT_INT_MASK_0;
        pstcInit->u16BufState = TMR4_CNT_BUFFER_DISABLE;
        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  De-Initialize TMR4 counter function
 * @param  [in] TMR4x                   Pointer to TMR4 instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMR4_1:            TMR4 unit 1 instance register base
 *           @arg M4_TMR4_2:            TMR4 unit 2 instance register base
 *           @arg M4_TMR4_3:            TMR4 unit 3 instance register base
 * @retval None
 */
void TMR4_CNT_DeInit(M4_TMR4_TypeDef *TMR4x)
{
    /* Check parameters */
    DDL_ASSERT(IS_VALID_TMR4_INSTANCE(TMR4x));

    /* Configures the registers to reset value. */
    WRITE_REG16(TMR4x->CCSR, 0x0050U);
    WRITE_REG16(TMR4x->CPSR, 0xFFFFU);
    WRITE_REG16(TMR4x->CVPR, 0x0000U);
}

/**
 * @brief Set TMR4 counter clock source
 * @param  [in] TMR4x                   Pointer to TMR4 instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMR4_1:            TMR4 unit 1 instance register base
 *           @arg M4_TMR4_2:            TMR4 unit 2 instance register base
 *           @arg M4_TMR4_3:            TMR4 unit 3 instance register base
 * @param  [in] u16ClkSrc               TMR4 CNT clock source
 *         This parameter can be one of the following values:
 *           @arg TMR4_CNT_PCLK:      Uses the internal clock (PCLK) as counter's count clock
 *           @arg TMR4_CNT_EXTCLK:    Uses an external input clock (EXCK) as counter's count clock
 * @retval None
 * @note   The PCLK division function is valid when clock source is PCLK
 */
void TMR4_CNT_SetClock(M4_TMR4_TypeDef *TMR4x, uint16_t u16ClkSrc)
{
    /* Check parameters */
    DDL_ASSERT(IS_VALID_TMR4_INSTANCE(TMR4x));
    DDL_ASSERT(IS_VALID_TMR4_CNT_CLK_SRC(u16ClkSrc));

    /* Set external clock enable bit */
    MODIFY_REG16(TMR4x->CCSR, TMR4_CCSR_ECKEN, u16ClkSrc);
}

/**
 * @brief Get TMR4 counter clock source
 * @param  [in] TMR4x                   Pointer to TMR4 instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMR4_1:            TMR4 unit 1 instance register base
 *           @arg M4_TMR4_2:            TMR4 unit 2 instance register base
 *           @arg M4_TMR4_3:            TMR4 unit 3 instance register base
 * @retval Returned value can be one of the following values:
 *           @arg TMR4_CNT_PCLK:      Uses the internal clock (PCLK) as counter's count clock
 *           @arg TMR4_CNT_EXTCLK:    Uses an external input clock (EXCK) as counter's count clock
 */
uint16_t TMR4_CNT_GetClock(const M4_TMR4_TypeDef *TMR4x)
{
    /* Check parameters */
    DDL_ASSERT(IS_VALID_TMR4_INSTANCE(TMR4x));

    /* Get external clock enable bit */
    return READ_REG16_BIT(TMR4x->CCSR, TMR4_CCSR_ECKEN);
}

/**
 * @brief  Set TMR4 counter clock division
 * @param  [in] TMR4x                   Pointer to TMR4 instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMR4_1:            TMR4 unit 1 instance register base
 *           @arg M4_TMR4_2:            TMR4 unit 2 instance register base
 *           @arg M4_TMR4_3:            TMR4 unit 3 instance register base
 * @param  [in] u16Div                  TMR4 clock division
 *         This parameter can be one of the following values:
 *           @arg TMR4_CNT_PCLK_DIV1:    PCLK
 *           @arg TMR4_CNT_PCLK_DIV2:    PCLK/2
 *           @arg TMR4_CNT_PCLK_DIV4:    PCLK/4
 *           @arg TMR4_CNT_PCLK_DIV8:    PCLK/8
 *           @arg TMR4_CNT_PCLK_DIV16:   PCLK/16
 *           @arg TMR4_CNT_PCLK_DIV32:   PCLK/32
 *           @arg TMR4_CNT_PCLK_DIV64:   PCLK/64
 *           @arg TMR4_CNT_PCLK_DIV128:  PCLK/128
 *           @arg TMR4_CNT_PCLK_DIV256:  PCLK/256
 *           @arg TMR4_CNT_PCLK_DIV512:  PCLK/512
 *           @arg TMR4_CNT_PCLK_DIV1024: PCLK/1024
 * @retval None
 * @note   The PCLK division function is valid when clock source is PCLK
 */
void TMR4_CNT_SetPclkDiv(M4_TMR4_TypeDef *TMR4x, uint16_t u16Div)
{
    /* Check parameters */
    DDL_ASSERT(IS_VALID_TMR4_INSTANCE(TMR4x));
    DDL_ASSERT(IS_VALID_TMR4_CNT_PCLK_DIV(u16Div));

