RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_tmr4.c
    MODIFY_REG16(TMR4x->CCSR, TMR4_CCSR_CKDIV, u16Div);
}

/**
 * @brief  Get TMR4 counter clock division
 * @param  [in] TMR4x                   Pointer to TMR4 instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMR4_1:            TMR4 unit 1 instance register base
 *           @arg M4_TMR4_2:            TMR4 unit 2 instance register base
 *           @arg M4_TMR4_3:            TMR4 unit 3 instance register base
 * @retval Returned value can be one of the following values:
 *           @arg TMR4_CNT_PCLK_DIV1:    PCLK
 *           @arg TMR4_CNT_PCLK_DIV2:    PCLK/2
 *           @arg TMR4_CNT_PCLK_DIV4:    PCLK/4
 *           @arg TMR4_CNT_PCLK_DIV8:    PCLK/8
 *           @arg TMR4_CNT_PCLK_DIV16:   PCLK/16
 *           @arg TMR4_CNT_PCLK_DIV32:   PCLK/32
 *           @arg TMR4_CNT_PCLK_DIV64:   PCLK/64
 *           @arg TMR4_CNT_PCLK_DIV128:  PCLK/128
 *           @arg TMR4_CNT_PCLK_DIV256:  PCLK/256
 *           @arg TMR4_CNT_PCLK_DIV512:  PCLK/512
 *           @arg TMR4_CNT_PCLK_DIV1024: PCLK/1024
 * @note   The PCLK division function is valid when clock source is PCLK
 */
uint16_t TMR4_CNT_GetPclkDiv(const M4_TMR4_TypeDef *TMR4x)
{
    /* Check parameters */
    DDL_ASSERT(IS_VALID_TMR4_INSTANCE(TMR4x));

    return READ_REG16_BIT(TMR4x->CCSR, TMR4_CCSR_CKDIV);
}

/**
 * @brief Set TMR4 counter mode
 * @param  [in] TMR4x                   Pointer to TMR4 instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMR4_1:            TMR4 unit 1 instance register base
 *           @arg M4_TMR4_2:            TMR4 unit 2 instance register base
 *           @arg M4_TMR4_3:            TMR4 unit 3 instance register base
 * @param  [in] u16Mode                 TMR4 counter mode
 *         This parameter can be one of the following values:
 *           @arg TMR4_CNT_MODE_SAWTOOTH_WAVE: TMR4 count mode:sawtooth wave
 *           @arg TMR4_CNT_MODE_TRIANGLE_WAVE: TMR4 count mode:triangular wave
 * @retval None
 */
void TMR4_CNT_SetMode(M4_TMR4_TypeDef *TMR4x, uint16_t u16Mode)
{
    /* Check parameters */
    DDL_ASSERT(IS_VALID_TMR4_INSTANCE(TMR4x));
    DDL_ASSERT(IS_VALID_TMR4_CNT_MODE(u16Mode));

    /* Set external clock enable bit */
    MODIFY_REG16(TMR4x->CCSR, TMR4_CCSR_MODE, u16Mode);
}

/**
 * @brief Get TMR4 counter mode
 * @param  [in] TMR4x                   Pointer to TMR4 instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMR4_1:            TMR4 unit 1 instance register base
 *           @arg M4_TMR4_2:            TMR4 unit 2 instance register base
 *           @arg M4_TMR4_3:            TMR4 unit 3 instance register base
 * @retval Returned value can be one of the following values:
 *           @arg TMR4_CNT_MODE_SAWTOOTH_WAVE: TMR4 count mode:sawtooth wave
 *           @arg TMR4_CNT_MODE_TRIANGLE_WAVE: TMR4 count mode:triangular wave
 */
uint16_t TMR4_CNT_GetMode(const M4_TMR4_TypeDef *TMR4x)
{
    /* Check parameters */
    DDL_ASSERT(IS_VALID_TMR4_INSTANCE(TMR4x));

    /* Get external clock enable bit */
    return READ_REG16_BIT(TMR4x->CCSR, TMR4_CCSR_MODE);
}

/**
 * @brief  Get TMR4 counter flag
 * @param  [in] TMR4x                   Pointer to TMR4 instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMR4_1:            TMR4 unit 1 instance register base
 *           @arg M4_TMR4_2:            TMR4 unit 2 instance register base
 *           @arg M4_TMR4_3:            TMR4 unit 3 instance register base
 * @param  [in] u16Flag                 TMR4 flag
 *         This parameter can be any composed value of the following values:
 *           @arg TMR4_CNT_FLAG_PEAK: Overflow interrupt
 *           @arg TMR4_CNT_FLAG_ZERO: Underflow interrupt
 * @retval An en_flag_status_t enumeration value:
 *           - Set: Flag is set
 *           - Reset: Flag is reset
 */
en_flag_status_t TMR4_CNT_GetStatus(const M4_TMR4_TypeDef *TMR4x,
                                        uint16_t u16Flag)
{
    /* Check parameters */
    DDL_ASSERT(IS_VALID_TMR4_INSTANCE(TMR4x));
    DDL_ASSERT(IS_VALID_TMR4_CNT_FLAG(u16Flag));

    return (READ_REG16_BIT(TMR4x->CCSR, u16Flag) != 0U) ? Set : Reset;
}

/**
 * @brief  Clear TMR4 counter flag
 * @param  [in] TMR4x                   Pointer to TMR4 instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMR4_1:            TMR4 unit 1 instance register base
 *           @arg M4_TMR4_2:            TMR4 unit 2 instance register base
 *           @arg M4_TMR4_3:            TMR4 unit 3 instance register base
 * @param  [in] u16Flag                 TMR4 counter flag
 *         This parameter can be any composed value of the following values:
 *           @arg TMR4_CNT_FLAG_PEAK:   Overflow interrupt
 *           @arg TMR4_CNT_FLAG_ZERO:   Underflow interrupt
 * @retval None
 */
void TMR4_CNT_ClearStatus(M4_TMR4_TypeDef *TMR4x, uint16_t u16Flag)
{
    /* Check parameters */
    DDL_ASSERT(IS_VALID_TMR4_INSTANCE(TMR4x));
    DDL_ASSERT(IS_VALID_TMR4_CNT_FLAG(u16Flag));

    CLEAR_REG16_BIT(TMR4x->CCSR, u16Flag);
}

/**
 * @brief  Enable or disable specified TMR4 counter interrupt
 * @param  [in] TMR4x                   Pointer to TMR4 instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMR4_1:            TMR4 unit 1 instance register base
 *           @arg M4_TMR4_2:            TMR4 unit 2 instance register base
 *           @arg M4_TMR4_3:            TMR4 unit 3 instance register base
 * @param  [in] u16IntSource            TMR4 interrupt source
 *         This parameter can be any composed value of the following values:
 *           @arg TMR4_CNT_INT_PEAK:    Overflow interrupt
 *           @arg TMR4_CNT_INT_ZERO:    Underflow interrupt
 * @param  [in] enNewState              The function new state
 *           @arg  This parameter can be: Enable or Disable
 * @retval None
 */
void TMR4_CNT_IntCmd(M4_TMR4_TypeDef *TMR4x,
                            uint16_t u16IntSource,
                            en_functional_state_t enNewState)
{
    /* Check parameters */
    DDL_ASSERT(IS_VALID_TMR4_INSTANCE(TMR4x));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));
    DDL_ASSERT(IS_VALID_TMR4_CNT_INT(u16IntSource));

