RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_tmr4.c
    if (NULL == pu16MaskTimes)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Check parameters */
        DDL_ASSERT(IS_VALID_TMR4_INSTANCE(TMR4x));

        switch (u16IntSource)
        {
            case TMR4_CNT_INT_ZERO:
                *pu16MaskTimes = (uint16_t)(READ_REG16_BIT(TMR4x->CVPR, TMR4_CVPR_ZIC) >> TMR4_CVPR_ZIC_POS);
                break;
            case TMR4_CNT_INT_PEAK:
                *pu16MaskTimes = (uint16_t)(READ_REG16_BIT(TMR4x->CVPR, TMR4_CVPR_PIC) >> TMR4_CVPR_PIC_POS);
                break;
            default:
                DDL_ASSERT(NULL);
                enRet = ErrorInvalidParameter;
                break;
        }
    }

    return enRet;
}

/**
 * @brief  Set TMR4 count direction signal output to port
 * @param  [in] TMR4x               Pointer to TMR4 instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMR4_1:        TMR4 unit 1 instance register base
 *           @arg M4_TMR4_2:        TMR4 unit 2 instance register base
 *           @arg M4_TMR4_3:        TMR4 unit 3 instance register base
 * @param  [in] enNewState          The function new state
 *           @arg  This parameter can be: Enable or Disable
 * @retval None
 */
void TMR4_CNT_PortOutputDirSigCmd(M4_TMR4_TypeDef *TMR4x,
                                        en_functional_state_t enNewState)
{
    /* Check parameters */
    DDL_ASSERT(IS_VALID_TMR4_INSTANCE(TMR4x));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    if (Enable == enNewState)
    {
        SET_REG16_BIT(TMR4x->SCER, TMR4_SCER_PCTS);
    }
    else
    {
        CLEAR_REG16_BIT(TMR4x->SCER, TMR4_SCER_PCTS);
    }
}

/**
 * @}
 */

/**
 * @defgroup TMR4_OCO_Global_Functions TMR4 OCO Global Functions
 * @{
 */

/**
 * @brief  Initialize TMR4 OCO
 * @param  [in] TMR4x               Pointer to TMR4 instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMR4_1:        TMR4 unit 1 instance register base
 *           @arg M4_TMR4_2:        TMR4 unit 2 instance register base
 *           @arg M4_TMR4_3:        TMR4 unit 3 instance register base
 * @param  [in] u32Ch               TMR4 OCO channel
 *         This parameter can be one of the following values:
 *           @arg TMR4_OCO_UH:      TMR4 OCO channel - UH
 *           @arg TMR4_OCO_UL:      TMR4 OCO channel - UL
 *           @arg TMR4_OCO_VH:      TMR4 OCO channel - VH
 *           @arg TMR4_OCO_VL:      TMR4 OCO channel - VL
 *           @arg TMR4_OCO_WH:      TMR4 OCO channel - WH
 *           @arg TMR4_OCO_WL:      TMR4 OCO channel - WL
 * @param  [in] pstcInit            Pointer to a @ref stc_tmr4_oco_init_t structure
 * @retval An en_result_t enumeration value:
 *           - Ok: Initialize successfully
 *           - ErrorInvalidParameter: u32Ch is invalid or pstcInit = NULL
 */
en_result_t TMR4_OCO_Init(M4_TMR4_TypeDef *TMR4x,
                                uint32_t u32Ch,
                                const stc_tmr4_oco_init_t *pstcInit)
{
    uint16_t u16Val;
    __IO uint16_t *TMR4_OCER;
    __IO uint16_t *TMR4_OCSR;
    __IO uint16_t *TMR4_OCCR;
    en_result_t enRet = ErrorInvalidParameter;

    /* Check structure pointer */
    if (NULL != pstcInit)
    {
        /* Check parameters */
        DDL_ASSERT(IS_VALID_TMR4_INSTANCE(TMR4x));
        DDL_ASSERT(IS_VALID_TMR4_OCO_CH(u32Ch));
        DDL_ASSERT(IS_VALID_TMR4_OCO_STATE(pstcInit->u16OcoCmd));
        DDL_ASSERT(IS_VALID_TMR4_OCO_OCCR_LINK_TRANSFER(pstcInit->u16OccrLinkTransfer));
        DDL_ASSERT(IS_VALID_TMR4_OCO_OCMR_LINK_TRANSFER(pstcInit->u16OcmrLinkTransfer));
        DDL_ASSERT(IS_VALID_TMR4_OCO_OCCR_BUF_MODE(pstcInit->u16OccrBufMode));
        DDL_ASSERT(IS_VALID_TMR4_OCO_OCMR_BUF_MODE(pstcInit->u16OcmrBufMode));
        DDL_ASSERT(IS_VALID_TMR4_OCO_PORT_INVALID_OP(pstcInit->u16OcoInvalidOp));

        /* Get pointer of current channel OCO register address */
        TMR4_OCSR = TMR4_OCSRx(TMR4x, u32Ch);
        TMR4_OCER = TMR4_OCERx(TMR4x, u32Ch);
        TMR4_OCCR = TMR4_OCCRx(TMR4x, u32Ch);

        /* Set port output valid && OP level && interrupt */
        u16Val = ((uint16_t)(pstcInit->u16OcoCmd << SHIFT_1BIT(u32Ch))  | \
                  (uint16_t)(pstcInit->u16OcoInvalidOp << SHIFT_1BIT(u32Ch)));
        MODIFY_REG16(*TMR4_OCSR, TMR4_OCSR_MASK(u32Ch), u16Val);

        /* Set OCMR&&OCCR buffer */
        u16Val = (TMR4_OCER_CxBUFEN(u32Ch, pstcInit->u16OccrBufMode) | \
                  TMR4_OCER_MxBUFEN(u32Ch, pstcInit->u16OcmrBufMode) | \
                  TMR4_OCER_LMCx(u32Ch, pstcInit->u16OccrLinkTransfer) | \
                  TMR4_OCER_LMMx(u32Ch, pstcInit->u16OcmrLinkTransfer));
        MODIFY_REG16(*TMR4_OCER, TMR4_OCER_MASK(u32Ch), u16Val);

        /* Set OCO compare match value */
        WRITE_REG16(*TMR4_OCCR, pstcInit->u16CompareVal);
        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  Set the fields of structure stc_tmr4_oco_init_t to default values
 * @param  [out] pstcInit               Pointer to a @ref stc_tmr4_oco_init_t structure
 * @retval An en_result_t enumeration value:
 *           - Ok: Initialize successfully
 *           - ErrorInvalidParameter: pstcInit = NULL
 */
en_result_t TMR4_OCO_StructInit(stc_tmr4_oco_init_t *pstcInit)
{
    en_result_t enRet = ErrorInvalidParameter;

    /* Check structure pointer */
    if (NULL != pstcInit)
    {
        pstcInit->u16OcoCmd = TMR4_OCO_ENABLE;
        pstcInit->u16OccrLinkTransfer = TMR4_OCO_OCCR_LINK_TRANSFER_DISABLE;
        pstcInit->u16OcmrLinkTransfer = TMR4_OCO_OCMR_LINK_TRANSFER_DISABLE;
        pstcInit->u16OccrBufMode = TMR4_OCO_OCCR_BUF_DISABLE;
        pstcInit->u16OcmrBufMode = TMR4_OCO_OCMR_BUF_DISABLE;
        pstcInit->u16OcoInvalidOp = TMR4_OCO_INVAILD_OP_LOW;
        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  De-initialize TMR4 OCO
 * @param  [in] TMR4x                   Pointer to TMR4 instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMR4_1:            TMR4 unit 1 instance register base
 *           @arg M4_TMR4_2:            TMR4 unit 2 instance register base
 *           @arg M4_TMR4_3:            TMR4 unit 3 instance register base
 * @param  [in] u32Ch               TMR4 OCO channel
 *         This parameter can be one of the following values:
 *           @arg TMR4_OCO_UH:      TMR4 OCO channel - UH
 *           @arg TMR4_OCO_UL:      TMR4 OCO channel - UL
 *           @arg TMR4_OCO_VH:      TMR4 OCO channel - VH
 *           @arg TMR4_OCO_VL:      TMR4 OCO channel - VL
 *           @arg TMR4_OCO_WH:      TMR4 OCO channel - WH
 *           @arg TMR4_OCO_WL:      TMR4 OCO channel - WL
 * @retval None
 */
void TMR4_OCO_DeInit(M4_TMR4_TypeDef *TMR4x, uint32_t u32Ch)
{
    __IO uint16_t *TMR4_OCER;
    __IO uint16_t *TMR4_OCSR;
    __IO uint16_t *TMR4_OCCR;

    /* Check parameters */
    DDL_ASSERT(IS_VALID_TMR4_INSTANCE(TMR4x));
    DDL_ASSERT(IS_VALID_TMR4_OCO_CH(u32Ch));

    /* Get pointer of current channel OCO register address */
    TMR4_OCSR = TMR4_OCSRx(TMR4x, u32Ch);
    TMR4_OCER = TMR4_OCERx(TMR4x, u32Ch);
    TMR4_OCCR = TMR4_OCCRx(TMR4x, u32Ch);

    /* Clear bits: port output valid && OP level && interrupt */
    CLEAR_REG16_BIT(*TMR4_OCSR, TMR4_OCSR_MASK(u32Ch));

    /* Clear bits: OCMR&&OCCR buffer */
    CLEAR_REG16_BIT(*TMR4_OCER, TMR4_OCER_MASK(u32Ch));

    /* Set OCO compare match value */
    WRITE_REG16(*TMR4_OCCR, 0x0000U);
}

/**
 * @brief  Set TMR4 OCO OCCR buffer mode
 * @param  [in] TMR4x               Pointer to TMR4 instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMR4_1:        TMR4 unit 1 instance register base
 *           @arg M4_TMR4_2:        TMR4 unit 2 instance register base
 *           @arg M4_TMR4_3:        TMR4 unit 3 instance register base
 * @param  [in] u32Ch               TMR4 OCO channel
 *         This parameter can be one of the following values:
 *           @arg TMR4_OCO_UH:      TMR4 OCO channel - UH
 *           @arg TMR4_OCO_UL:      TMR4 OCO channel - UL
 *           @arg TMR4_OCO_VH:      TMR4 OCO channel - VH
 *           @arg TMR4_OCO_VL:      TMR4 OCO channel - VL
 *           @arg TMR4_OCO_WH:      TMR4 OCO channel - WH
 *           @arg TMR4_OCO_WL:      TMR4 OCO channel - WL
 * @param  [in] u16OccrBufMode      TMR4 OCO OCCR buffer mode
 *         This parameter can be one of the following values:
 *           @arg TMR4_OCO_OCCR_BUF_DISABLE:          Disable the register OCCR buffer function
 *           @arg TMR4_OCO_OCCR_BUF_CNT_ZERO:         Register OCCR buffer transfer when counter value is 0x0000
 *           @arg TMR4_OCO_OCCR_BUF_CNT_PEAK:         Register OCCR buffer transfer when counter value is CPSR
 *           @arg TMR4_OCO_OCCR_BUF_CNT_ZERO_OR_PEAK: Register OCCR buffer transfer when the value is both 0 and CPSR
 * @retval None
 */
void TMR4_OCO_SetOccrBufMode(M4_TMR4_TypeDef *TMR4x,
                                uint32_t u32Ch,
                                uint16_t u16OccrBufMode)
{
    __IO uint16_t *TMR4_OCER;

    /* Check parameters */
    DDL_ASSERT(IS_VALID_TMR4_INSTANCE(TMR4x));
    DDL_ASSERT(IS_VALID_TMR4_OCO_CH(u32Ch));
    DDL_ASSERT(IS_VALID_TMR4_OCO_OCCR_BUF_MODE(u16OccrBufMode));

    /* Get pointer of current channel OCO register address */
    TMR4_OCER = TMR4_OCERx(TMR4x, u32Ch);

    /* Set OCER register: OCCR buffer mode */
    MODIFY_REG16(*TMR4_OCER, \
                 TMR4_OCER_CxBUFEN_MASK(u32Ch), \
                 TMR4_OCER_CxBUFEN(u32Ch, u16OccrBufMode));
}

/**
 * @brief  Get TMR4 OCO OCCR buffer mode
 *         This parameter can be one of the following values:
 * @param  [in] TMR4x               Pointer to TMR4 instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMR4_1:        TMR4 unit 1 instance register base
 *           @arg M4_TMR4_2:        TMR4 unit 2 instance register base
 *           @arg M4_TMR4_3:        TMR4 unit 3 instance register base
 * @param  [in] u32Ch               TMR4 OCO channel
 *           @arg TMR4_OCO_UH:      TMR4 OCO channel - UH
 *           @arg TMR4_OCO_UL:      TMR4 OCO channel - UL
 *           @arg TMR4_OCO_VH:      TMR4 OCO channel - VH
 *           @arg TMR4_OCO_VL:      TMR4 OCO channel - VL
 *           @arg TMR4_OCO_WH:      TMR4 OCO channel - WH
 *           @arg TMR4_OCO_WL:      TMR4 OCO channel - WL
 * @retval Returned value can be one of the following values:
 *           @arg TMR4_OCO_OCCR_BUF_DISABLE:          Disable the register OCCR buffer function
 *           @arg TMR4_OCO_OCCR_BUF_CNT_ZERO:         Register OCCR buffer transfer when counter value is 0x0000
 *           @arg TMR4_OCO_OCCR_BUF_CNT_PEAK:         Register OCCR buffer transfer when counter value is CPSR
 *           @arg TMR4_OCO_OCCR_BUF_CNT_ZERO_OR_PEAK: Register OCCR buffer transfer when the value is both 0 and CPSR
 */
uint16_t TMR4_OCO_GetOccrBufMode(const M4_TMR4_TypeDef *TMR4x,
                                            uint32_t u32Ch)
{
    uint16_t OccrBufMode;
    __IO uint16_t *TMR4_OCER;

    /* Check parameters */
    DDL_ASSERT(IS_VALID_TMR4_INSTANCE(TMR4x));
    DDL_ASSERT(IS_VALID_TMR4_OCO_CH(u32Ch));

    /* Get pointer of current channel OCO register address */
    TMR4_OCER = TMR4_OCERx(TMR4x, u32Ch);

    /* Get OCCR buffer mode */
    OccrBufMode = READ_REG16_BIT(*TMR4_OCER, TMR4_OCER_CxBUFEN_MASK(u32Ch));

    return (uint16_t)(OccrBufMode >> SHIFT_2BIT(u32Ch));
}

/**
 * @brief  Set TMR4 OCO OCCR buffer link transfer function
 * @param  [in] TMR4x               Pointer to TMR4 instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMR4_1:        TMR4 unit 1 instance register base
 *           @arg M4_TMR4_2:        TMR4 unit 2 instance register base
 *           @arg M4_TMR4_3:        TMR4 unit 3 instance register base
 * @param  [in] u32Ch               TMR4 OCO channel
 *         This parameter can be one of the following values:
 *           @arg TMR4_OCO_UH:      TMR4 OCO channel - UH
 *           @arg TMR4_OCO_UL:      TMR4 OCO channel - UL
 *           @arg TMR4_OCO_VH:      TMR4 OCO channel - VH
 *           @arg TMR4_OCO_VL:      TMR4 OCO channel - VL
 *           @arg TMR4_OCO_WH:      TMR4 OCO channel - WH
 *           @arg TMR4_OCO_WL:      TMR4 OCO channel - WL
 * @param  [in] u16TransferState    The OCO OCCR buffer link transfer state
 *           @arg TMR4_OCO_OCCR_LINK_TRANSFER_DISABLE: Disable the register OCCR buffer link transfer function
 *           @arg TMR4_OCO_OCCR_LINK_TRANSFER_ENABLE: Register OCCR buffer transfer when the value is both 0 and CPSR and ZIC/PIC is 0
 * @retval None
 */
void TMR4_OCO_SetOccrLinkTransfer(M4_TMR4_TypeDef *TMR4x,
                                            uint32_t u32Ch,
                                            uint16_t u16TransferState)
{
    __IO uint16_t *TMR4_OCER;

    /* Check parameters */
    DDL_ASSERT(IS_VALID_TMR4_INSTANCE(TMR4x));
    DDL_ASSERT(IS_VALID_TMR4_OCO_CH(u32Ch));
    DDL_ASSERT(IS_VALID_TMR4_OCO_OCCR_LINK_TRANSFER(u16TransferState));

    /* Get pointer of current channel OCO register address */
    TMR4_OCER = TMR4_OCERx(TMR4x, u32Ch);

