RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_tmr4.c
    /* Set OCER register: OCCR link transfer function */
    MODIFY_REG16(*TMR4_OCER, \
                 TMR4_OCER_LMCx_MASK(u32Ch), \
                 TMR4_OCER_LMCx(u32Ch, u16TransferState));
}

/**
 * @brief  Set TMR4 OCO OCMR buffer mode
 * @param  [in] TMR4x               Pointer to TMR4 instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMR4_1:        TMR4 unit 1 instance register base
 *           @arg M4_TMR4_2:        TMR4 unit 2 instance register base
 *           @arg M4_TMR4_3:        TMR4 unit 3 instance register base
 * @param  [in] u32Ch               TMR4 OCO channel
 *         This parameter can be one of the following values:
 *           @arg TMR4_OCO_UH:      TMR4 OCO channel - UH
 *           @arg TMR4_OCO_UL:      TMR4 OCO channel - UL
 *           @arg TMR4_OCO_VH:      TMR4 OCO channel - VH
 *           @arg TMR4_OCO_VL:      TMR4 OCO channel - VL
 *           @arg TMR4_OCO_WH:      TMR4 OCO channel - WH
 *           @arg TMR4_OCO_WL:      TMR4 OCO channel - WL
 * @param  [in] u16OcmrBufMode      TMR4 OCO OCCR buffer mode
 *         This parameter can be one of the following values:
 *           @arg TMR4_OCO_OCMR_BUF_DISABLE:          Disable the register OCMR buffer function
 *           @arg TMR4_OCO_OCMR_BUF_CNT_ZERO:         Register OCMR buffer transfer when counter value is 0x0000
 *           @arg TMR4_OCO_OCMR_BUF_CNT_PEAK:         Register OCMR buffer transfer when counter value is CPSR
 *           @arg TMR4_OCO_OCMR_BUF_CNT_ZERO_OR_PEAK: Register OCMR buffer transfer when the value is both 0 and CPSR
 * @retval None
 */
void TMR4_OCO_SetOcmrBufMode(M4_TMR4_TypeDef *TMR4x,
                                        uint32_t u32Ch,
                                        uint16_t u16OcmrBufMode)
{
    __IO uint16_t *TMR4_OCER;

    /* Check parameters */
    DDL_ASSERT(IS_VALID_TMR4_INSTANCE(TMR4x));
    DDL_ASSERT(IS_VALID_TMR4_OCO_CH(u32Ch));
    DDL_ASSERT(IS_VALID_TMR4_OCO_OCMR_BUF_MODE(u16OcmrBufMode));

    /* Get pointer of current channel OCO register address */
    TMR4_OCER = TMR4_OCERx(TMR4x, u32Ch);

    /* Set OCER register: OCMR buffer mode */
    MODIFY_REG16(*TMR4_OCER, \
                 TMR4_OCER_MxBUFEN_MASK(u32Ch), \
                 TMR4_OCER_MxBUFEN(u32Ch, u16OcmrBufMode));
}

/**
 * @brief  Get TMR4 OCO OCMR buffer mode
 * @param  [in] TMR4x               Pointer to TMR4 instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMR4_1:        TMR4 unit 1 instance register base
 *           @arg M4_TMR4_2:        TMR4 unit 2 instance register base
 *           @arg M4_TMR4_3:        TMR4 unit 3 instance register base
 * @param  [in] u32Ch               TMR4 OCO channel
 *         This parameter can be one of the following values:
 *           @arg TMR4_OCO_UH:      TMR4 OCO channel - UH
 *           @arg TMR4_OCO_UL:      TMR4 OCO channel - UL
 *           @arg TMR4_OCO_VH:      TMR4 OCO channel - VH
 *           @arg TMR4_OCO_VL:      TMR4 OCO channel - VL
 *           @arg TMR4_OCO_WH:      TMR4 OCO channel - WH
 *           @arg TMR4_OCO_WL:      TMR4 OCO channel - WL
 * @retval Returned value can be one of the following values:
 *         This parameter can be one of the following values:
 *           @arg TMR4_OCO_OCMR_BUF_DISABLE:          Disable the register OCMR buffer function
 *           @arg TMR4_OCO_OCMR_BUF_CNT_ZERO:         Register OCMR buffer transfer when counter value is 0x0000
 *           @arg TMR4_OCO_OCMR_BUF_CNT_PEAK:         Register OCMR buffer transfer when counter value is CPSR
 *           @arg TMR4_OCO_OCMR_BUF_CNT_ZERO_OR_PEAK: Register OCMR buffer transfer when the value is both 0 and CPSR
 */
uint16_t TMR4_OCO_GetOcmrBufMode(const M4_TMR4_TypeDef *TMR4x,
                                            uint32_t u32Ch)
{
    uint16_t u16OcmrBufMode;
    __IO uint16_t *TMR4_OCER;

    /* Check parameters */
    DDL_ASSERT(IS_VALID_TMR4_INSTANCE(TMR4x));
    DDL_ASSERT(IS_VALID_TMR4_OCO_CH(u32Ch));

    /* Get pointer of current channel OCO register address */
    TMR4_OCER = TMR4_OCERx(TMR4x, u32Ch);

    /* Get OCCR buffer mode */
    u16OcmrBufMode = READ_REG16_BIT(*TMR4_OCER, TMR4_OCER_MxBUFEN_MASK(u32Ch));

    return (uint16_t)(u16OcmrBufMode >> SHIFT_2BIT(u32Ch));
}

/**
 * @brief  Set TMR4 OCO OCMR buffer link transfer function
 * @param  [in] TMR4x               Pointer to TMR4 instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMR4_1:        TMR4 unit 1 instance register base
 *           @arg M4_TMR4_2:        TMR4 unit 2 instance register base
 *           @arg M4_TMR4_3:        TMR4 unit 3 instance register base
 * @param  [in] u32Ch               TMR4 OCO channel
 *         This parameter can be one of the following values:
 *           @arg TMR4_OCO_UH:      TMR4 OCO channel - UH
 *           @arg TMR4_OCO_UL:      TMR4 OCO channel - UL
 *           @arg TMR4_OCO_VH:      TMR4 OCO channel - VH
 *           @arg TMR4_OCO_VL:      TMR4 OCO channel - VL
 *           @arg TMR4_OCO_WH:      TMR4 OCO channel - WH
 *           @arg TMR4_OCO_WL:      TMR4 OCO channel - WL
 * @param  [in] u16TransferState    The OCO OCCR buffer link transfer state
 *           @arg TMR4_OCO_OCCR_LINK_TRANSFER_DISABLE: Disable the register OCCR buffer link transfer function
 *           @arg TMR4_OCO_OCCR_LINK_TRANSFER_ENABLE: Register OCCR buffer transfer when the value is both 0 and CPSR and ZIC/PIC is 0
 * @retval None
 */
void TMR4_OCO_SetOcmrLinkTransfer(M4_TMR4_TypeDef *TMR4x,
                                            uint32_t u32Ch,
                                            uint16_t u16TransferState)
{
    __IO uint16_t *TMR4_OCER;

    /* Check parameters */
    DDL_ASSERT(IS_VALID_TMR4_INSTANCE(TMR4x));
    DDL_ASSERT(IS_VALID_TMR4_OCO_CH(u32Ch));
    DDL_ASSERT(IS_VALID_TMR4_OCO_OCMR_LINK_TRANSFER(u16TransferState));

    /* Get pointer of current channel OCO register address */
    TMR4_OCER = TMR4_OCERx(TMR4x, u32Ch);

    /* Set OCER register: OCMR link transfer function */
    MODIFY_REG16(*TMR4_OCER, \
                 TMR4_OCER_LMMx_MASK(u32Ch), \
                 TMR4_OCER_LMMx(u32Ch, u16TransferState));
}

/**
 * @brief  Extend the matching conditions of TMR4 OCO channel
 * @param  [in] TMR4x               Pointer to TMR4 instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMR4_1:        TMR4 unit 1 instance register base
 *           @arg M4_TMR4_2:        TMR4 unit 2 instance register base
 *           @arg M4_TMR4_3:        TMR4 unit 3 instance register base
 * @param  [in] u32Ch               TMR4 OCO channel
 *         This parameter can be one of the following values:
 *           @arg TMR4_OCO_UH:      TMR4 OCO channel - UH
 *           @arg TMR4_OCO_UL:      TMR4 OCO channel - UL
 *           @arg TMR4_OCO_VH:      TMR4 OCO channel - VH
 *           @arg TMR4_OCO_VL:      TMR4 OCO channel - VL
 *           @arg TMR4_OCO_WH:      TMR4 OCO channel - WH
 *           @arg TMR4_OCO_WL:      TMR4 OCO channel - WL
 * @param  [in] u16ExtMatch          TMR4 OCO extend match function selection
 *           @arg TMR4_OCO_EXTEND_MATCH_DISABLE: Disable TMR4 OCO extend match function
 *           @arg TMR4_OCO_EXTEND_MATCH_ENABLE: Enable TMR4 OCO extend match function
 * @retval None
 */
void TMR4_OCO_SetExtMatchCond(M4_TMR4_TypeDef *TMR4x,
                                        uint32_t u32Ch,
                                        uint16_t u16ExtMatch)
{
    __IO uint16_t *TMR4_OCER;

    /* Check parameters */
    DDL_ASSERT(IS_VALID_TMR4_INSTANCE(TMR4x));
    DDL_ASSERT(IS_VALID_TMR4_OCO_CH(u32Ch));
    DDL_ASSERT(IS_VALID_TMR4_OCO_EXTEND_MATCH(u16ExtMatch));

    /* Get pointer of current channel OCO register address */
    TMR4_OCER = TMR4_OCERx(TMR4x, u32Ch);

    /* Set OCER register: Extend match function */
    MODIFY_REG16(*TMR4_OCER, \
                 TMR4_OCER_MCECx_MASK(u32Ch), \
                 TMR4_OCER_MCECx(u32Ch, u16ExtMatch));
}

/**
 * @brief  Set the TMR4 OCO high channel mode
 * @param  [in] TMR4x               Pointer to TMR4 instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMR4_1:        TMR4 unit 1 instance register base
 *           @arg M4_TMR4_2:        TMR4 unit 2 instance register base
 *           @arg M4_TMR4_3:        TMR4 unit 3 instance register base
 * @param  [in] u32Ch               TMR4 OCO channel.
 *         This parameter can be one of the following values:
 *           @arg TMR4_OCO_UH:      TMR4 OCO channel - UH
 *           @arg TMR4_OCO_VH:      TMR4 OCO channel - VH
 *           @arg TMR4_OCO_WH:      TMR4 OCO channel - WH
 * @param  [in] pstcMode            Pointer to a @ref stc_oco_high_ch_compare_mode_t structure of the TMR4 OCO high channel mode
 * @retval An en_result_t enumeration value:
 *           - Ok: Set successfully
 *           - ErrorInvalidParameter: pstcMode = NULL
 */
en_result_t TMR4_OCO_SetHighChCompareMode(M4_TMR4_TypeDef *TMR4x,
                                uint32_t u32Ch,
                                const stc_oco_high_ch_compare_mode_t *pstcMode)
{
    __IO uint16_t *TMR4_OCER;
    __IO uint16_t *TMR4_OCMRxH;
    en_result_t enRet = ErrorInvalidParameter;

