RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_tmr4.c
    if (Enable == enNewState)
    {
        CLEAR_REG16_BIT(TMR4x->RCSR, TMR4_RCSR_RTIDx_MASK(u32Ch));
    }
    else
    {
        SET_REG16_BIT(TMR4x->RCSR, TMR4_RCSR_RTIDx_MASK(u32Ch));
    }
}

/**
 * @brief  Get PWM reload-timer interrupt flag
 * @param  [in] TMR4x               Pointer to TMR4 instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMR4_1:        TMR4 unit 1 instance register base
 *           @arg M4_TMR4_2:        TMR4 unit 2 instance register base
 *           @arg M4_TMR4_3:        TMR4 unit 3 instance register base
 * @param  [in] u32Ch               TMR4 PWM channel
 *         This parameter can be one of the following values:
 *           @arg TMR4_PWM_U:       TMR4 PWM couple channel - U
 *           @arg TMR4_PWM_V:       TMR4 PWM couple channel - V
 *           @arg TMR4_PWM_W:       TMR4 PWM couple channel - W
 * @retval An en_flag_status_t enumeration value:
 *           - Reset                None interrupt request on PWM reload-timer
 *           - Set                  Detection interrupt request on PWM reload-timer
 */
en_flag_status_t TMR4_PWM_GetStatus(const M4_TMR4_TypeDef *TMR4x,
                                        uint32_t u32Ch)
{
    __IO uint16_t *TMR4_RCSR;

    /* Check parameters */
    DDL_ASSERT(IS_VALID_TMR4_INSTANCE(TMR4x));
    DDL_ASSERT(IS_VALID_TMR4_PWM_CH(u32Ch));

    /* Get pointer of current channel PWM register address */
    TMR4_RCSR = TMR4_RCSRx(TMR4x);

    return (READ_REG16_BIT(*TMR4_RCSR, TMR4_RCSR_RTIFx_MASK(u32Ch)) ? Set : Reset);
}

/**
 * @brief  Clear PWM reload-timer interrupt flag
 * @param  [in] TMR4x               Pointer to TMR4 instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMR4_1:        TMR4 unit 1 instance register base
 *           @arg M4_TMR4_2:        TMR4 unit 2 instance register base
 *           @arg M4_TMR4_3:        TMR4 unit 3 instance register base
 * @param  [in] u32Ch               TMR4 PWM channel
 *         This parameter can be one of the following values:
 *           @arg TMR4_PWM_U:       TMR4 PWM couple channel - U
 *           @arg TMR4_PWM_V:       TMR4 PWM couple channel - V
 *           @arg TMR4_PWM_W:       TMR4 PWM couple channel - W
 * @retval None
 */
void TMR4_PWM_ClearStatus(M4_TMR4_TypeDef *TMR4x,
                                uint32_t u32Ch)
{
    /* Check parameters */
    DDL_ASSERT(IS_VALID_TMR4_INSTANCE(TMR4x));
    DDL_ASSERT(IS_VALID_TMR4_PWM_CH(u32Ch));

    SET_REG16_BIT(TMR4x->RCSR, TMR4_RCSR_RTICx_MASK(u32Ch));
}

/**
 * @brief  Set TMR4 PWM dead region count
 * @param  [in] TMR4x               Pointer to TMR4 instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMR4_1:        TMR4 unit 1 instance register base
 *           @arg M4_TMR4_2:        TMR4 unit 2 instance register base
 *           @arg M4_TMR4_3:        TMR4 unit 3 instance register base
 * @param  [in] u32Ch               TMR4 PWM channel
 *         This parameter can be one of the following values:
 *           @arg TMR4_PWM_U:       TMR4 PWM couple channel - U
 *           @arg TMR4_PWM_V:       TMR4 PWM couple channel - V
 *           @arg TMR4_PWM_W:       TMR4 PWM couple channel - W
 * @param  [in] u16PDAR             PDAR value
 *           @arg number of 16bit
 * @param  [in] u16PDBR             PDBR value
 *           @arg number of 16bit
 * @retval None
 */
void TMR4_PWM_SetDeadRegionValue(M4_TMR4_TypeDef *TMR4x,
                                            uint32_t u32Ch,
                                            uint16_t u16PDAR,
                                            uint16_t u16PDBR)
{
    __IO uint16_t *TMR4_PDAR;
    __IO uint16_t *TMR4_PDBR;

    /* Check parameters */
    DDL_ASSERT(IS_VALID_TMR4_INSTANCE(TMR4x));
    DDL_ASSERT(IS_VALID_TMR4_PWM_CH(u32Ch));

    /* Get pointer of current channel PWM register address */
    TMR4_PDAR = TMR4_PDARx(TMR4x, u32Ch);
    TMR4_PDBR = TMR4_PDBRx(TMR4x, u32Ch);

    WRITE_REG16(*TMR4_PDAR, u16PDAR);
    WRITE_REG16(*TMR4_PDBR, u16PDBR);
}

/**
 * @brief  Get TMR4 PWM dead region count
 * @param  [in] TMR4x               Pointer to TMR4 instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMR4_1:        TMR4 unit 1 instance register base
 *           @arg M4_TMR4_2:        TMR4 unit 2 instance register base
 *           @arg M4_TMR4_3:        TMR4 unit 3 instance register base
 * @param  [in] u32Ch               TMR4 PWM channel
 *         This parameter can be one of the following values:
 *           @arg TMR4_PWM_U:       TMR4 PWM couple channel - U
 *           @arg TMR4_PWM_V:       TMR4 PWM couple channel - V
 *           @arg TMR4_PWM_W:       TMR4 PWM couple channel - W
 * @param  [out] pu16PDAR           Pointer of 16bit data
 *           @arg pointer of 16bit
 * @param  [out] pu16PDBR           Pointer of 16bit data
 *           @arg pointer of 16bit
 * @retval None
 */
void TMR4_PWM_GetDeadRegionValue(const M4_TMR4_TypeDef *TMR4x,
                                            uint32_t u32Ch,
                                            uint16_t *pu16PDAR,
                                            uint16_t *pu16PDBR)
{
    __IO uint16_t *TMR4_PDAR;
    __IO uint16_t *TMR4_PDBR;

    /* Check parameters */
    DDL_ASSERT(IS_VALID_TMR4_INSTANCE(TMR4x));
    DDL_ASSERT(IS_VALID_TMR4_PWM_CH(u32Ch));

    /* Get pointer of current channel PWM register address */
    TMR4_PDAR = TMR4_PDARx(TMR4x, u32Ch);
    TMR4_PDBR = TMR4_PDBRx(TMR4x, u32Ch);

    *pu16PDAR = READ_REG16(*TMR4_PDAR);
    *pu16PDBR = READ_REG16(*TMR4_PDBR);
}

/**
 * @brief  Set TMR4 PWM filter count value
 * @param  [in] TMR4x               Pointer to TMR4 instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMR4_1:        TMR4 unit 1 instance register base
 *           @arg M4_TMR4_2:        TMR4 unit 2 instance register base
 *           @arg M4_TMR4_3:        TMR4 unit 3 instance register base
 * @param  [in] u32Ch               TMR4 PWM channel
 *         This parameter can be one of the following values:
 *           @arg TMR4_PWM_U:       TMR4 PWM couple channel - U
 *           @arg TMR4_PWM_V:       TMR4 PWM couple channel - V
 *           @arg TMR4_PWM_W:       TMR4 PWM couple channel - W
 * @param  [in] u16Count            TMR4 PWM filter count value
 *           @arg number of 16bit
 * @retval None
 */
void TMR4_PWM_SetFilterCountValue(M4_TMR4_TypeDef *TMR4x,
                                            uint32_t u32Ch,
                                            uint16_t u16Count)
{
    __IO uint16_t *TMR4_PFSR;

    /* Check parameters */
    DDL_ASSERT(IS_VALID_TMR4_INSTANCE(TMR4x));
    DDL_ASSERT(IS_VALID_TMR4_PWM_CH(u32Ch));

    /* Get pointer of current channel PWM register address */
    TMR4_PFSR = TMR4_PFSRx(TMR4x, u32Ch);

