RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_tmr4.c
    WRITE_REG16(*TMR4_PFSR, u16Count);
}

/**
 * @brief Enable TMR4 PWM master output
 * @param  [in] TMR4x               Pointer to TMR4 instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMR4_1:        TMR4 unit 1 instance register base
 *           @arg M4_TMR4_2:        TMR4 unit 2 instance register base
 *           @arg M4_TMR4_3:        TMR4 unit 3 instance register base
 * @param  [in] enNewState          The function new state
 *           @arg  This parameter can be: Enable or Disable
 * @retval None
 */
void TMR4_PWM_AutoOutputCmd(M4_TMR4_TypeDef *TMR4x,
                                        en_functional_state_t enNewState)
{
    /* Check parameters */
    DDL_ASSERT(IS_VALID_TMR4_INSTANCE(TMR4x));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    if (Enable == enNewState)
    {
        SET_REG32_BIT(TMR4x->PSCR, TMR4_PSCR_AOE);
    }
    else
    {
        CLEAR_REG32_BIT(TMR4x->PSCR, TMR4_PSCR_AOE);
    }
}

/**
 * @brief Enable TMR4 PWM master output
 * @param  [in] TMR4x               Pointer to TMR4 instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMR4_1:        TMR4 unit 1 instance register base
 *           @arg M4_TMR4_2:        TMR4 unit 2 instance register base
 *           @arg M4_TMR4_3:        TMR4 unit 3 instance register base
 * @param  [in] enNewState          The function new state
 *           @arg  This parameter can be: Enable or Disable
 * @retval None
 */
void TMR4_PWM_MasterOutputCmd(M4_TMR4_TypeDef *TMR4x,
                                        en_functional_state_t enNewState)
{
    /* Check parameters */
    DDL_ASSERT(IS_VALID_TMR4_INSTANCE(TMR4x));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    if (Enable == enNewState)
    {
        SET_REG32_BIT(TMR4x->PSCR, TMR4_PSCR_MOE);
    }
    else
    {
        CLEAR_REG32_BIT(TMR4x->PSCR, TMR4_PSCR_MOE);
    }
}

/**
 * @brief Set TMR4 PWM port output mode
 * @param  [in] TMR4x               Pointer to TMR4 instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMR4_1:        TMR4 unit 1 instance register base
 *           @arg M4_TMR4_2:        TMR4 unit 2 instance register base
 *           @arg M4_TMR4_3:        TMR4 unit 3 instance register base
 * @param  [in] u32PwmPort          TMR4 PWM channel
 *         This parameter can be one of the following values:
 *           @arg TMR4_PWM_PORT_OUH:  TMR4 PWM port - TIM4_<t>_OUH
 *           @arg TMR4_PWM_PORT_OUL:  TMR4 PWM port - TIM4_<t>_OUL
 *           @arg TMR4_PWM_PORT_OVH:  TMR4 PWM port - TIM4_<t>_OVH
 *           @arg TMR4_PWM_PORT_OVL:  TMR4 PWM port - TIM4_<t>_OVL
 *           @arg TMR4_PWM_PORT_OWH:  TMR4 PWM port - TIM4_<t>_OWH
 *           @arg TMR4_PWM_PORT_OWL:  TMR4 PWM port - TIM4_<t>_OWL
 * @param  [in] u32Mode             The PWM port output mode
 *         This parameter can be one of the following values:
 *           @arg TMR4_PWM_PORT_OUTPUT_OSxy: TIM4_<t>_Oxy output polarity by specified OSxy
 *           @arg TMR4_PWM_PORT_OUTPUT_NORMAL: TIM4_<t>_Oxy output normal PWM
 * @retval None
 */
void TMR4_PWM_PortOutputMode(M4_TMR4_TypeDef *TMR4x,
                                    uint32_t u32PwmPort,
                                    uint32_t u32Mode)
{
    /* Check parameters */
    DDL_ASSERT(IS_VALID_TMR4_INSTANCE(TMR4x));
    DDL_ASSERT(IS_VALID_TMR4_PWM_PORT(u32PwmPort));
    DDL_ASSERT(IS_VALID_TMR4_PWM_PORT_MODE(u32Mode));

    MODIFY_REG32(TMR4x->PSCR, \
                 TMR4_PSCR_OExy_MASK(u32PwmPort), \
                 TMR4_PSCR_OExy(u32PwmPort, u32Mode));
}

/**
 * @brief Set TMR4 PWM port enable bit effective time
 * @param  [in] TMR4x               Pointer to TMR4 instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMR4_1:        TMR4 unit 1 instance register base
 *           @arg M4_TMR4_2:        TMR4 unit 2 instance register base
 *           @arg M4_TMR4_3:        TMR4 unit 3 instance register base
 * @param  [in] u32EffectTime       Effective time
 *         This parameter can be one of the following values:
 *           @arg TMR4_PWM_PORT_ENBIT_EFFECT_IMMEDIATE:Effective time - Immediate
 *           @arg TMR4_PWM_PORT_ENBIT_EFFECT_CNTUVF: Effective time - TMR4 counter underflow
 *           @arg TMR4_PWM_PORT_ENBIT_EFFECT_CNTOVF: Effective time - TMR4 counter overflow
 * @retval None
 */
void TMR4_PWM_SetPortEnBitEffectTime(M4_TMR4_TypeDef *TMR4x,
                                                    uint32_t u32EffectTime)
{
    /* Check parameters */
    DDL_ASSERT(IS_VALID_TMR4_INSTANCE(TMR4x));
    DDL_ASSERT(IS_VALID_TMR4_PWM_PORT_ENBIT_EFFECT(u32EffectTime));

    MODIFY_REG32(TMR4x->PSCR, TMR4_PSCR_ODT, u32EffectTime);
}

/**
 * @brief Get TMR4 PWM port state
 * @param  [in] TMR4x               Pointer to TMR4 instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMR4_1:        TMR4 unit 1 instance register base
 *           @arg M4_TMR4_2:        TMR4 unit 2 instance register base
 *           @arg M4_TMR4_3:        TMR4 unit 3 instance register base
 * @retval Returned value can be one of the following values:
 *           @arg TMR4_PWM_PORT_ENBIT_EFFECT_IMMEDIATE:TMR4 PWM port enable bit effective Time - Immediate
 *           @arg TMR4_PWM_PORT_ENBIT_EFFECT_CNTUVF: TMR4 PWM port enable bit effective Time - TMR4 counter underflow
 *           @arg TMR4_PWM_PORT_ENBIT_EFFECT_CNTOVF: TMR4 PWM port enable bit effective Time - TMR4 counter overflow
 */
uint32_t TMR4_PWM_GetPortEnBitEffectTime(const M4_TMR4_TypeDef *TMR4x)
{
    /* Check parameters */
    DDL_ASSERT(IS_VALID_TMR4_INSTANCE(TMR4x));

    return READ_REG32_BIT(TMR4x->PSCR, TMR4_PSCR_ODT);
}

/**
 * @brief TMR4 PWM port output when emb event occur
 * @param  [in] TMR4x               Pointer to TMR4 instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMR4_1:        TMR4 unit 1 instance register base
 *           @arg M4_TMR4_2:        TMR4 unit 2 instance register base
 *           @arg M4_TMR4_3:        TMR4 unit 3 instance register base
 * @param  [in] u32PwmPort          TMR4 PWM channel
 *         This parameter can be one of the following values:
 *           @arg TMR4_PWM_PORT_OUH:  TMR4 PWM port - TIM4_<t>_OUH
 *           @arg TMR4_PWM_PORT_OUL:  TMR4 PWM port - TIM4_<t>_OUL
 *           @arg TMR4_PWM_PORT_OVH:  TMR4 PWM port - TIM4_<t>_OVH
 *           @arg TMR4_PWM_PORT_OVL:  TMR4 PWM port - TIM4_<t>_OVL
 *           @arg TMR4_PWM_PORT_OWH:  TMR4 PWM port - TIM4_<t>_OWH
 *           @arg TMR4_PWM_PORT_OWL:  TMR4 PWM port - TIM4_<t>_OWL
 * @param  [in] u32State            The port new state
 *         This parameter can be one of the following values:
 *           @arg TMR4_PWM_EMB_PORT_OUTPUT_NORMAL:TIM4_<t>_Oxy output normal
 *           @arg TMR4_PWM_EMB_PORT_OUTPUT_HIZ:   TIM4_<t>_Oxy output Hi-z
 *           @arg TMR4_PWM_EMB_PORT_OUTPUT_LOW:   TIM4_<t>_Oxy output low level
 *           @arg TMR4_PWM_EMB_PORT_OUTPUT_HIGH:  TIM4_<t>_Oxy output high level
 * @retval None
 */
void TMR4_PWM_EmbPwmPortOutputState(M4_TMR4_TypeDef *TMR4x,
                                            uint32_t u32PwmPort,
                                            uint32_t u32State)
{
    /* Check parameters */
    DDL_ASSERT(IS_VALID_TMR4_INSTANCE(TMR4x));
    DDL_ASSERT(IS_VALID_TMR4_PWM_PORT(u32PwmPort));
    DDL_ASSERT(IS_VALID_TMR4_PWM_EMB_PORT_OUTPUT_STATE(u32State));

    MODIFY_REG32(TMR4x->PSCR, \
                 TMR4_PSCR_OSxy_MASK(u32PwmPort), \
                 TMR4_PSCR_OSxy(u32PwmPort, u32State));
}

/**
 * @}
 */

/**
 * @defgroup TMR4_SEVT_Global_Functions TMR4 SEVT Global Functions
 * @{
 */

/**
 * @brief  Initialize TMR4 SEVT
 * @param  [in] TMR4x               Pointer to TMR4 instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMR4_1:        TMR4 unit 1 instance register base
 *           @arg M4_TMR4_2:        TMR4 unit 2 instance register base
 *           @arg M4_TMR4_3:        TMR4 unit 3 instance register base
 * @param  [in] u32Ch               TMR4 SEVT channel
 *         This parameter can be one of the following values:
 *           @arg TMR4_SEVT_UH:     TMR4 SEVT channel - UH
 *           @arg TMR4_SEVT_UL:     TMR4 SEVT channel - UL
 *           @arg TMR4_SEVT_VH:     TMR4 SEVT channel - VH
 *           @arg TMR4_SEVT_VL:     TMR4 SEVT channel - VL
 *           @arg TMR4_SEVT_WH:     TMR4 SEVT channel - WH
 *           @arg TMR4_SEVT_WL:     TMR4 SEVT channel - WL
 * @param  [in] pstcInit            Pointer to a @ref stc_tmr4_sevt_init_t structure
 * @retval An en_result_t enumeration value:
 *           - Ok: Initialize successfully
 *           - ErrorInvalidParameter: u32Ch is invalid or pstcInit = NULL
 */
en_result_t TMR4_SEVT_Init(M4_TMR4_TypeDef *TMR4x,
                                    uint32_t u32Ch,
                                    const stc_tmr4_sevt_init_t *pstcInit)
{
    __IO uint16_t *TMR4_SCCR;
    __IO uint16_t *TMR4_SCSR;
    __IO uint16_t *TMR4_SCMR;
    en_result_t enRet = ErrorInvalidParameter;

