RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_tmr4.c
    MODIFY_REG16(TMR4x->SCER, TMR4_SCER_EVTRS, u16EvtSignal);
}

/**
 * @brief  Get TMR4 SEVT event signal output to port
 * @param  [in] TMR4x               Pointer to TMR4 instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMR4_1:        TMR4 unit 1 instance register base
 *           @arg M4_TMR4_2:        TMR4 unit 2 instance register base
 *           @arg M4_TMR4_3:        TMR4 unit 3 instance register base
 * @retval Returned value can be one of the following values:
 *           @arg TMR4_SEVT_PORT_OUTPUT_NONE: Disable output event signal of TMR4 Special-EVT
 *           @arg TMR4_SEVT_PORT_OUTPUT_EVENT0_SIGNAL: Output the specified event 0 signal of TMR4 Special-EVT
 *           @arg TMR4_SEVT_PORT_OUTPUT_EVENT1_SIGNAL: Output the specified event 1 signal of TMR4 Special-EVT
 *           @arg TMR4_SEVT_PORT_OUTPUT_EVENT2_SIGNAL: Output the specified event 2 signal of TMR4 Special-EVT
 *           @arg TMR4_SEVT_PORT_OUTPUT_EVENT3_SIGNAL: Output the specified event 3 signal of TMR4 Special-EVT
 *           @arg TMR4_SEVT_PORT_OUTPUT_EVENT4_SIGNAL: Output the specified event 4 signal of TMR4 Special-EVT
 *           @arg TMR4_SEVT_PORT_OUTPUT_EVENT5_SIGNAL: Output the specified event 5 signal of TMR4 Special-EVT
 */
uint16_t TMR4_SEVT_GetPortOutputEventSig(const M4_TMR4_TypeDef *TMR4x)
{
    /* Check parameters */
    DDL_ASSERT(IS_VALID_TMR4_INSTANCE(TMR4x));

    return READ_REG16_BIT(TMR4x->SCER, TMR4_SCER_EVTRS);
}

/**
 * @}
 */

/**
 * @}
 */

#endif /* DDL_TMR4_ENABLE */

/**
 * @}
 */

/**
* @}
*/

/******************************************************************************
 * EOF (not truncated)
 *****************************************************************************/
